# Ты разрабатываешь программное обеспечение для сети магазинов. Каждый магазин в этой сети
# имеет свои особенности, но также существуют общие характеристики, такие как адрес, название и
# ассортимент товаров. Ваша задача — создать класс Store, который можно будет использовать для
# создания различных магазинов.

class Store():
    def __init__(self, name, address, items):
items = {name, prise}

    name: название магазина.

    address: адрес магазина.

    items: словарь, где ключ - название товара, а значение - его цена. Например, {'apples': 0.5, 'bananas': 0.75}.

